[
    {
        "date": "Oct 2022 - Present",
        "title": "Front-end Developer",
        "company": "ZeptoLab",
        "companyLink": "https://zeptolab.com/",
        "description": "Developed an internal tool to track Google Play and App Store ratings, as well as crash/ANR rates, using Nest.js, Postgres, Prisma, and React (all fully typed with TypeScript).\nBuilt and launched careers.zeptolab.com, a new website for job openings, using Gatsby.js and styled-components (also in TypeScript), enhancing the candidate experience and streamlining the hiring process.\nCurrently developing internal tools for the Player XP and other teams using TypeScript, React, Redux, GraphQL, Nest.js, Material UI, Chakra UI, improving team productivity and enabling data-driven decision-making.\nCollaborated with cross-functional teams to deliver cutting-edge solutions that meet business objectives and exceed user expectations.",
        "technologies": [
            "React",
            "TypeScript",
            "Next.js",
            "Gatsby.js",
            "Styled-Components",
            "GraphQL",
            "Nest.js",
            "Redux",
            "Tailwind CSS",
            "Apollo Client",
            "Material UI",
            "Chakra UI",
            "Postgres",
            "Prisma"
        ]
    },
    {
        "date": "Dec 2020 - Jul 2022",
        "title": "Player XP Team Lead",
        "company": "Tilting Point",
        "companyLink": "https://tiltingpoint.com/",
        "description": "Built and led high-performing teams, delivering exceptional player experiences.\nAligned team goals with business objectives and industry best practices.\nImplemented technology and automation, resulting in cost savings and improved player satisfaction.\nMentored new team members and drove team success.",
        "technologies": [
            "Zendesk",
            "HelpShift",
            "Jira",
            "Confluence",
            "Asana",
            "Slack",
            "Google Sheets",
            "Google Docs",
            "Google Data Studio",
            "Google Slides"
        ]
    },
    {
        "date": "Aug 2019 - Dec 2020",
        "title": "Project Manager",
        "company": "Plarium",
        "companyLink": "https://plarium.com/",
        "description": "Led ChatBot project to improve Customer Support productivity.\nImplemented machine learning tool for Google Play reviews, increasing processed reviews by 66%.\nGathered project requirements with stakeholders.\nEstablished optimized work schedules using agile methodologies.",
        "technologies": [
            "Jira",
            "Confluence",
            "Slack",
            "Google Sheets",
            "Google Docs",
            "Google Slides"
        ]
    },
    {
        "date": "Dec 2018 - Aug 2019",
        "title": "Community Management Lead",
        "company": "Plarium",
        "companyLink": "https://plarium.com/",
        "description": "Assisted the director in leading and managing a team of 53 members, promoting collaboration and teamwork.\nImproved team processes, increasing productivity, efficiency, and customer satisfaction.\nDeveloped and implemented strategic plans for department growth and success.\nProvided regular reports and analysis on departmental performance to facilitate data-driven decision-making.",
        "technologies": null
    },
    {
        "date": "Oct 2015 - Dec 2018",
        "title": "Senior CS Team Lead",
        "company": "Plarium",
        "companyLink": "https://plarium.com/",
        "description": "Led and coached three Team Leads, driving a culture of excellence and collaboration.\nAnalyzed data to identify strategies for improving service and productivity, implementing improvements.\nImplemented new help desk system and internal tools, improving efficiency and customer satisfaction.\nEstablished a knowledge base to decrease ticket volume and improve response times.",
        "technologies": null
    },
    {
        "date": "Apr 2014 - Oct 2015",
        "title": "Customer Support Team Lead",
        "company": "Plarium",
        "companyLink": "https://plarium.com/",
        "description": "Hired and managed a team of 20 customer service agents, fostering a culture of excellence and teamwork.\nPlanned, assigned, and monitored work tasks for optimal team efficiency, ensuring timely and high-quality service delivery.\nConducted monthly staff performance evaluations, identifying and addressing development needs to drive team success.\nFormulated and implemented customer service policies and procedures, improving overall customer satisfaction.",
        "technologies": null
    }
]