[
  {
    "name": "Kate Khait",
    "avatar": "/images/kate.jpeg",
    "company": "Plarium",
    "role": "Director of Game Platforms, Product Director at Plarium",
    "linkedIn": "https://www.linkedin.com/in/kate-khait/",
    "text": "When Alex joined our team he was assigned a huge project of plarium.com's overhaul, where we had to completely change the architecture of the platform, and moved to a more modern tech stack. As a Project Manager, Alex was very tech-savvy, making him very respected among the developers' team. He was always very attentive to details and followed up on crucial changes in time. I recommend Alex as a very responsible employee, and I think that his management experience would be very helpful in any software development role that he chooses for himself."
  },
  {
    "name": "Judith Hoffman",
    "avatar": "/images/judith.jpeg",
    "company": "Pixelberry Studios",
    "role": "Chief Operating Officer",
    "linkedIn": "https://www.linkedin.com/in/judithhoffman/",
    "text": "I worked with Alex at Tilting Point, where he was the lead for the Player XP (community and customer support) team. Alex was an excellent and organized staff manager, and was responsible for recruiting in more experienced people for the Community team. Alex was responsible for migrating the TP games to a common Customer Support platform: he took point on evaluating the systems and services offered, helped negotiate with the providers and managed the migration, which went smoothly with no customer facing disruption. Alex also implemented regular reporting and tracking metrics to measure the quality of our Player XP offering. He defined a set of graduated community offerings as part of a support package for TP's business development offering. In summary: Smart, capable, well organized, technically adept, willing to dive into the details but also delegated well to his staff."
  },
  {
    "name": "Olya Hladyk",
    "avatar": "/images/olya.jpeg",
    "company": "Plarium",
    "role": "LiveOps Specialist",
    "linkedIn": "https://www.linkedin.com/in/olyahladyk/",
    "text": "Alex is one of those rare people who are willing to go above and beyond in any project they create. He is always very passionate about projects he creates or investigates, constantly learning and keeping up with new technologies. I worked with Alex for more than 3 years, and through all this time he kept driving our team to higher and higher goals. He was the one who constantly brought in new ideas and solutions that would change any workflow or project for the better. I highly recommend working with Alex, and I am 100% sure that his energy and hard work will bring any business to an entirely new level."
  }
]